src/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ОбщегоНазначения/Ext/Module.bsl
Функция ЕстьПравоНаИзменениеДокумента(Ссылка) Экспорт
	Если Ссылка.Ответственный = ПараметрыСеанса.ТекущийПользователь Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьСтатусДокумента(Ссылка) Экспорт
	Если ЗначениеЗаполнено(Ссылка) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатусыДокументовСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыДокументов.СрезПоследних(, Документ = &Ссылка) КАК СтатусыДокументовСрезПоследних";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтатусДокумента = ВыборкаДетальныеЗаписи.Статус;
		КонецЦикла;
		    
		Иначе
			СтатусДокумента = Справочники.СтатусыДокументов.Черновик;
		КонецЕсли; 
	
	Возврат СтатусДокумента;
КонецФункции

Процедура УстановитьСтатусДокумента(ЗНАЧ Документ, Статус) Экспорт
	Если ТипЗнч(Документ) = Тип("ДанныеФормыСтруктура") Тогда 
		Документ = Документ.Ссылка;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Прочитать();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Документ = Документ;
	НоваяЗапись.Статус = Статус;
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПроверитьСтатусДокументаПриЗаписи(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыДокументов.Период КАК Период,
		|	СтатусыДокументов.Документ КАК Документ,
		|	СтатусыДокументов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
		|ГДЕ
		|	СтатусыДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		УстановитьСтатусДокумента(Документ, Справочники.СтатусыДокументов.Черновик);
	КонецЕсли;

КонецПроцедуры
